package com.minbar.tafhimulquran.Fragment;

import android.annotation.SuppressLint;
import android.app.Dialog;
import android.graphics.drawable.ColorDrawable;
import android.os.Bundle;

import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.text.Html;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.view.WindowManager;
import android.widget.ImageView;
import android.widget.TextView;

import com.minbar.tafhimulquran.Adapter.VumikaAdapter;
import com.minbar.tafhimulquran.R;
import com.minbar.tafhimulquran.Utils.FontFamily;
import com.minbar.tafhimulquran.Utils.FontSize;
import com.minbar.tafhimulquran.Utils.SqlLiteDbHelper;


public class OthersFragment extends Fragment {


    //public static MainActivity mainActivity;
    VumikaAdapter adapter;
    SqlLiteDbHelper dbHelper;
    RecyclerView recyclerView;
    //List<VerseModel> surahModelList;



    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View v = inflater.inflate(R.layout.fragment_others, container, false);



        v.findViewById(R.id.card_view1).setOnClickListener(v1 -> {
            aboutShow(1);
        });

        v.findViewById(R.id.card_view2).setOnClickListener(v1 -> {
            aboutShow(2);
        });

        v.findViewById(R.id.card_view3).setOnClickListener(v1 -> {
            aboutShow(3);
        });
        @SuppressLint({"MissingInflatedId", "LocalSuppress"}) TextView  f = v.findViewById(R.id.aboutF);
        @SuppressLint({"MissingInflatedId", "LocalSuppress"}) TextView vumila = v.findViewById(R.id.vumila);

        vumila.setTypeface(FontFamily.getBangla(getActivity()));
        vumila.setTextSize(2,Float.parseFloat(FontSize.getBangla(getActivity())));
        f.setTypeface(FontFamily.getBangla(getActivity()));
        f.setTextSize(2,Float.parseFloat(FontSize.getBangla(getActivity())));
        f.setText("তাফহিমুল কুরআন হলো মুসলিম দার্শনিক ও ইসলাম ধর্মের পণ্ডিত সাইয়েদ আবুল আলা মওদুদী (রহ)'র ভাষ্য অনুযায়ী ৬ খণ্ডে কুরআনের ব্যাখ্যামূলক অনুবাদ (তাফসীর)। মাওলানা মওদুদী এ তাফসীর লেখার জন্যে ৩০ বছর সময় ব্যয় করেন। তিনি ১৯৪২ সালে উর্দু ভাষায় শুরু করেন এবং ১৯৭২ সালে এটি সম্পন্ন করেন।\nবাংলা ভাষায় তাফহিমুল কুরআন প্রথম অনূদিত হয় খায়রুন প্রকাশনী থেকে মাওলানা মুহাম্মাদ আবদুর রহীম (রহ) দ্বারা। পরবর্তীতে মাওলানা আব্দুল মান্নান তালিব কর্তৃক অনূদিত তাফসীর প্রকাশ পায় আধুনিক প্রকাশনী থেকে। আমরা আমাদের অ্যাপটি আধুনিক প্রকাশনী থেকে প্রকাশিত তাফসীর-এর আলোকে তৈরি করেছি। সাথে ইংরেজি অনুবাদ হিসাবে Saheeh International এড করেছি।\nনিচে লেখক ও অনুবাদকের জীবনী তুলে ধরা হলঃ---");
        this.dbHelper = new SqlLiteDbHelper(getActivity());
        RecyclerView recyclerView2 = (RecyclerView) v.findViewById(R.id.recycler_others);
        this.recyclerView = recyclerView2;
        recyclerView2.setHasFixedSize(true);
        this.recyclerView.setLayoutManager(new LinearLayoutManager(getActivity()));
        //this.surahModelList = new ArrayList();
        this.adapter = new VumikaAdapter(getActivity(), this.dbHelper.getVumika());
        this.recyclerView.setAdapter(this.adapter);


        return v;
    }

    public void aboutShow(int s) {

        final Dialog dialog = new Dialog(getActivity());
        dialog.requestWindowFeature(1);
        dialog.setContentView(R.layout.about_surah_layout);
        dialog.setCancelable(true);
        dialog.setCanceledOnTouchOutside(false);
        dialog.getWindow().setBackgroundDrawable(new ColorDrawable(0));
        WindowManager.LayoutParams lp = new WindowManager.LayoutParams();
        lp.copyFrom(dialog.getWindow().getAttributes());
        lp.width = -1;
        lp.height = -1;

        TextView title_about = (TextView) dialog.findViewById(R.id.title_about);
        TextView aboutContent = (TextView) dialog.findViewById(R.id.aboutContent);

        ((ImageView) dialog.findViewById(R.id.copyLayout)).setVisibility(View.GONE);


        ImageView clear_about = (ImageView) dialog.findViewById(R.id.clear_about);
        clear_about.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                dialog.dismiss();
            }
        });

        if (s == 1){
            title_about.setText("সাইয়েদ আবুল আ'লা মওদুদী");
            aboutContent.setText(Html.fromHtml(a1));
        }else if (s == 2){
            title_about.setText("আব্দুল মান্নান তালিব");
            aboutContent.setText(Html.fromHtml(a2));
        }else if (s ==3){
            title_about.setText("Sahih International");
            aboutContent.setText(Html.fromHtml(a3));
        }

        dialog.show();
        dialog.getWindow().setAttributes(lp);
    }

    String a3 = "<p>The&nbsp;<strong>Saheeh International translation</strong>&nbsp;is an&nbsp;English Language translation&nbsp;of the&nbsp;Quran&nbsp;that has been used by Islam's most conservative adherents. Published by the Publishing House (dar),&nbsp;<em>dar&nbsp;Abul Qasim</em>, Saudi Arabia, it is one of the World's most popular Quran translations.</p>\n" +
            "<p>Translated by three American women, Umm Muhammad (Emily Assami), Mary Kennedy, and Amatullah Bantley, Notable conventions include rendering the&nbsp;God in Islam&nbsp;as&nbsp;<em>Allah</em>&nbsp;as they believe it is not okay to use the English word.</p>\n" +
            "<p>The translation has been described as biased towards \"Sunni orthodoxy\", which according to authors, requires words to be inserted in square parentheses.</p>\n" +
            "<p><em>Ṣaḥīḥ</em>&nbsp;(<span title=\"Arabic-language text\"><span lang=\"ar\">صحيح</span></span>) may be translated as \"authentic\" or \"sound.\"</p>\n" +
            "<h2><span id=\"Translators\" class=\"mw-headline\">Translators</span></h2>\n" +
            "<p>Emily Assami was born in&nbsp;California&nbsp;into an&nbsp;atheist&nbsp;family. She was married to an Arab husband. She studied Arabic at&nbsp;Damascus University. She was a former atheist who converted to Islam. She is known as&nbsp;<em>Umm Muhammad</em>&nbsp;or&nbsp;<em>Aminah</em>.</p>\n" +
            "<p>Mary Kennedy was born in&nbsp;Orlando. She was a former Christian who converted to Islam.</p>\n" +
            "<p>Amatullah Bantley was a former Catholic Christian. She was introduced to Islam through international Muslim students. She&nbsp;converted to Islam in 1986 and eventually moved to Saudi Arabia.</p>";

    String a2 = "<p>কবি, সাহিত্যিক, সাংবাদিক, সম্পাদক, সংগঠক, গবেষক, ঐতিহাসিক, প্রাবন্ধিক, শিশু সাহিত্যিক, বহুভাষাবিদ, বহু গ্রন্থকার দ্বীনের একনিষ্ঠ সেবক ও প্রচারক হযরত মাওলানা আবদুল মান্নান তালিব, যাকে আমরা অনেকেই অতি সহজে পরম শ্রদ্ধায় &lsquo;তালিব ভাই&rsquo; বলে ডাকতাম, তিনি ছিলেন কুরআন, হাদীস, তাফসির, কাব্য সাহিত্য, সংস্কৃতি, রাজনীতি, অর্থনীতি ও সমাজনীতি সম্পর্কে বহু জ্ঞানের অধিকারী, কিন্তু তিনি ছিলেন প্রশান্ত মহাসাগরের মত শান্ত, ধীরস্থির, ধৈর্যশীল, স্বল্পভাষী মহান এক ব্যক্তি। তাঁর গুণ দয়া, দান ও মহত্বের কথা দূরের এমনকি তার কাছের ও পাশের লোকেরা জানতেন না। কারণ তিনি ছিলেন প্রচার বিমুখ নীরব জ্ঞানের সাধক। তার মত এতো বড় ইসলামী চিন্তাবিদ, সত্যসন্ধানী, মুসলিম জাতির হিতাকাক্সক্ষী মানবপ্রেমিক পরহেজগার এবং আল্লাহওয়ালা লোক আমাদের সমাজে খুব কমই আছেন।</p>\n" +
            "<p>মাওলানা আবদুল মান্নান তালিব ১৯৩৬ সালের ১৫ মার্চ পশ্চিমবঙ্গের দক্ষিণ চব্বিশ পরগনা জেলার মগরহাট থানার অর্জুনপুর গ্রামে এক বর্ধিষ্ণু চাষী পরিবারে জন্মগ্রহণ করেন। তার পিতার নাম তালেব আলী মোল্লা এবং মাতার নাম মেহেরুন্নেসা। মান্নান তালিব সাত ভাই ও পাঁচ বোনের মধ্যে ছিলেন পঞ্চম। তার পিতার সাংসারিক অবস্থা ভালো থাকলেও বাল্যকালে তিনি আলালের ঘরের দুলালের মত প্রতিপালিত হননি। বিরাট পরিবারে পিতা ও চাচারা নানা কাজে ব্যস্ত থাকতেন সব সময়। তালেব আলী ছিলেন গ্রামের মাতাব্বর এবং খুব কড়া মেজাজের লোক। গ্রামের এমনকি তার পরিবারের কেউ তার সামনে দাঁড়িয়ে কথা বলতে সাহস পেতেন না। নোয়াখালী জেলার হাবিবুল্লাহ ভূঁইয়া মগরাহাট জুনিয়র মাদ্রাসার প্রধানশিক্ষক তার বাড়িতে গৃহশিক্ষক ছিলেন। তার কাছে আবদুল মান্নান তালিব বাংলা, ইংরেজি এবং শুদ্ধভাবে কুরআন শিক্ষা করেন। তারপর মগরাহাট মুসলিম হাইস্কুল থেকে ১৯৫০ সালে সুনামের সাথে প্রথম বিভাগে এন্ট্রান্স পরীক্ষায় উত্তীর্ণ হন। প্রতিটি ক্লাসে তার জন্য প্রথমস্থান রিজার্ভ ছিল। তার এক বছরের বড় সহোদর ভাই মাওলানা আবদুল হান্নান তবলীগ জামাতে বিখ্যাত মুবাল্লিগ, একই বছর মাধ্যমিক পরীক্ষায় উত্তীর্ণ হন। তার চেয়ে দুই বছরের বড় ভাই বিখ্যাত মুবাল্লিগ মাওলানা আবদুল হাকিম কাশিমী ১৯৫০ সালে কলকাতা ইসলামিয়া কলেজ (বর্তমানে আজাদ কলেজ) আইএসসি পাস করে ঢাকায় এমবিবিএস পড়তে চলে আসেন। বড় ভাই হান্নান মুরাদাবাদ গিয়ে মাদ্রাসায় হালাহে দারাইনে হিফজে কুরআন বিভাগে ভর্তি হন। এতে আবদুল মান্নান তালিবের ইচ্ছে হলো মাদ্রাসায় পড়তে।&nbsp;</p>\n" +
            "<p>তিনি মুরাদাবাদ গিয়ে মাদ্রাসায়ে এমদাদিয়াতে ভর্তি হন এবং সেখানে দুই বছর লেখাপড়া করেন। সেই সময় জালালাবাদ মাদ্রাসার একজন উস্তাদ করাচির সিন্ধু প্রদেশের টুন্ত অলাইয়ার শহরে দারুল উলুম মাদ্রাসায় যান। মান্নান তালিবও তাদের সঙ্গে গিয়ে সেখানে ভর্তি হন ১৯৫৩ সালে।</p>\n" +
            "<p>সেখানকার শায়খুল হাদীস এশিয়ার বিখ্যাত মুহাদ্দিস বুখারী শরীফ ২০ খ-ের ভাষ্যকার হযরত থানভী (রহ.) এর কাছে বুখারী পাঠ করে প্রথম স্থান অধিকার করেন। অতঃপর লাহোর চলে এসে সীরাতে মুস্তফা ও মাআরিফুল কুরআনের লেখক ও মিশকাত শরীফের আরবি ভাষ্যকার আততালীকুল সগীর গ্রন্থকার মাওলানা ইদরিত কান্ধলভীর সাহচর্যে পড়াশোনা করেন। এ সময় উর্দু ভাষায় প্রকাশিত সাপ্তাহিক এশিয়ায় ধারাবাহিকভাবে বিশেষ আর্টিকেল লেখা শুরু করেন। ১৯৫৩ থেকে ১৯৬০ সাল পর্যন্ত সাবেক পশ্চিম পাকিস্তানে অবস্থান করে বাংলাদেশের প্রখ্যাত আলেম মাওলানা আবদুর রহিম সাহেবের সান্নিধ্যে আসার ফলে বাংলা ভাষার জগতে বিচরণের সুবর্ণ সুযোগ লাভ করেন।</p>\n" +
            "<p>অতঃপর ঢাকায় এসে সাপ্তাহিক জাহানে নও পত্রিকার প্রথমে সাংবাদিক পরে সম্পাদনার দায়িত্বভার গ্রহণ করেন। পরবর্তীকালে মাসিক পৃথিবী ও মাসিক কলম একযোগে পরিচালনার দায়িত্বপ্রাপ্ত হন। সাবেক পশ্চিম পাকিস্তানে থাকাকালীন সময়ে তিনি উর্দুতে এম.এ. পরীক্ষায় উত্তীর্ণ হন। তিনি বাংলা এবং উর্দুতে এমন দক্ষতা অর্জন করেছিলেন যে, ভাষান্তরে তার সমকক্ষ মানুষ খুব কমই নজরে পড়ে।</p>\n" +
            "<p>শায়খুল হাদীস মাওলানা জাকারিয়া সাহারানপুরী রচিত তবলীগ জামাতের সর্বশ্রেষ্ঠ তালিমের গ্রন্থ ফাজায়েলে আমল বা তবলীগি নেসাব মুদ্রিত হওয়ার পূর্বে এই জামাতের প্রধান হাতিয়ার ছিল আল্লামা হাফেজ মহিউদ্দীন রচিত আরবি গ্রন্থ রিয়াদুস সালেহীন ও তার উর্দু তরজমা। তবলীগে নেসাব মুদ্রিত হওয়ার পর এই কিতাব কেবল আরবি মাদ্রাসার পাঠ্য তালিকায় স্থান ছিল। কিন্তু এর ভাবাদর্শ এতই মনোমুগ্ধকর লোভনীয় ছিল যে, আবদুল মান্নান তালিব এর বঙ্গানুবাদ এমন আকর্ষণীয় ভাষায় রূপান্তরিত করেন, যার ফলে দু&rsquo;খ- কিতাবকে চারখ-ে (ব্যাখ্যাসহ) মুদ্রিত করতে হয়। মান্নান তালিবের ভাষার ঔজ্জ্বল্যে কেবল আমেরিকায় বাঙালি অধিবাসীদের মধ্যে তখন পাঁচ হাজার কপি বিক্রি হয়। এমনিভাবে লক্ষে&egrave;ৗ ইসলামী বিশ্ববিদ্যালয়ের ভাইস চ্যান্সেলর মাওলানা সুলায়মান নদভীর কালজয়ী বক্তব্যের সংকলন খুদবাতে মাদ্রাজের বঙ্গানুবাদ &lsquo;পয়গামে মুহাম্মদী&rsquo; বাংলা সাহিত্য জগতে অমর সৃষ্টি। &lsquo;বাংলাদেশে ইসলাম&rsquo; বঙ্গে ইসলাম আগমনের প্রামাণ্য গবেষণামূলক সুবিশাল গ্রন্থ। সীরাতুল নবীর কয়েক খ-ের অনুবাদ, কবি আল্লামা ইকবালের রুমুজে বেখুদী, বালে জিবরীল, বাঙ্গেদারা প্রভৃতি কাব্যগ্রন্থের বাংলা কাব্যে অনুবাদ তার যোগ্যতার অম্লান দলিল।</p>\n" +
            "<p>তিনি কবি নজরুল ইসলাম ও কবি ফররুখ আহমদের কবিতা উর্দু ভাষায় অনুবাদ করে উর্দু ভাষীদের কাছে নজরুল ও ফররুখকে পরিচিত করেছেন। সময়ের পরিপ্রেক্ষিতে ইসলামী দিকনির্দেশনা দিতে বহু নতুন বিষয়ে প্রবন্ধ রচনা করেছেন। তার প্রবন্ধের সংখ্যা তিনশ&rsquo; এর বেশি। মৌলিক রচনা, অনুবাদ ও সম্পাদনা সব মিলিয়ে তার প্রকাশিত গ্রন্থের সংখ্যা ১৭৬টি। অনেক মূল্যবান গ্রন্থ অপ্রকাশিত রয়েছে।</p>\n" +
            "<p>আবদুল মান্নান তালিবের প্রথম প্রকাশিত বই &lsquo;অবরুদ্ধ জীবনের কথা; (১৯৬২) ইসলামিক ফাউন্ডেশন থেকে প্রকাশিত বাংলাদেশে ইসলাম (১৯৭৯) তার অসাধারণ গবেষণা গ্রন্থ। এই গ্রন্থে তিনি প্রত&oelig;তাত্ত্বিকের মত মাটি খুঁড়ে উদ্ধার করেছেন বাঙালি মুসলমানদের আত্মপরিচয়। কবি সাহিত্যিকদের পরমুখাপেক্ষিতা মুক্ত করতে তিনি রচনা করেছেন গুরুত্বপূর্ণ গ্রন্থ ইসলামী সাহিত্য; মূল্যবোধ ও উপাদান; সাহিত্য সংস্কৃতি ভাষা; ঐতিহ্যিক প্রেক্ষাপট, ইসলামী জীবন ও চিন্তার পুনর্গঠন, আধুনিক যুগের চ্যালেঞ্জ ও ইসলাম তার মৌলিক গ্রন্থের উল্লেখযোগ্য কয়েকটি। তার এই গ্রন্থগুলো কবি সাহিত্যিক ও সংস্কৃতিসেবীদের আদর্শশ্রয়ী হতে উৎসাহিত করে। তার অনূদিত নসীম হিজাজীর উপন্যাস এদেশের শিশু কিশোরসহ সকল শ্রেণির পাঠকদের ঐতিহ্যের সঙ্গে পরিচয় করিয়ে দেয়।</p>\n" +
            "<p>শিশুদের জন্য রচিত এসো জীবন গড়ি, পড়তে পড়তে অনেকজানা, মা আমার মা, আমাদের প্রিয় নবী, মজার গল্প, কে রাজা, হাতিসেনা, কপোকাত প্রভৃতি গ্রন্থ শিশু-কিশোরদের মানস গঠনে খুব উপযোগী। আমাদের সাহিত্য সংস্কৃতি ও সাংগঠনিক তৎপরতার ক্ষেত্রে আবদুল মান্নান তালিব দীর্ঘ অর্ধশতাব্দীকাল নিরলসভাবে কাজ করেছেন।</p>\n" +
            "<p>১৯৮৭ সাল থেকে মৃত্যু পর্যন্ত তিনি বাংলা সাহিত্য পরিষদের পরিচালকের দায়িত্ব পালনের পাশাপাশি ১৯৯৯ থেকে ইসলামিক &lsquo;ল&rsquo; রিসার্চ সেন্টার এন্ড লিগ্যাল এইড বাংলাদেশ এর ভাইস চেয়ারম্যানের দায়িত্ব পালন করেন। আবদুল মান্নান তালিব সম্পাদক হিসাবে অনন্য। তিনি বিভিন্ন সময় যেমন বিভিন্ন রকম পত্রিকা সম্পাদক করেছেন, তেমনি তৈরি করেছেন লেখক, গবেষক, অনুবাদক ও সম্পাদক।&nbsp;</p>\n" +
            "<p>আবদুল মান্নান তালিব বলেছেন, গোড়াতেই ১৯৬১ সালে আমরা করেছিলাম &lsquo;পাক সাহিত্য সংঘ&rsquo; ইসলামী ভাবধারা ভিত্তিক সাহিত্য সৃষ্টির জন্য। তারপর আমাদের বাংলা সাহিত্য পরিষদ আসছে সেই একই ধারা ভিত্তিক। আমরা চেষ্টা করে আসছি, সারাদেশে এখন আমাদের সমমনা অসংখ্য সাহিত্য সংগঠন গড়ে উঠেছে। আমাদের সাথে এখন শত শত লেখক জমায়েত হয়ে গেছেন। আল্লাহর রহমতে, আমাদের এখন হতাশার কোনো কারণ নেই। কারণ আমরা লেখকের সংখ্যা বাড়াতে পেরেছি এবং অসংখ্য আগ্রহী লেখক এখন চলে আসছেন। মানে এতে আশার সঞ্চার হচ্ছে, আমরা কিছু করতে পারবো। আমরা বাংলা সাহিত্যে একটা শক্তিশালী ধারা সৃষ্টি করতে পারবো, সাহিত্য ক্ষেত্রে আমরা একটা গুণগত পার্থক্য সৃষ্টি করতে পেরেছি।&rsquo;</p>\n" +
            "<p>আবদুল মান্নান তালিব জীবিতকালে তিনি তার কাজের যথার্থ সম্মান ও স্বীকৃতি পাননি। তিনি সারা জীবনই Unhonoured &amp; Unsung থেকেছেন। অবশ্য মানুষের কাছে কোনো সম্মান ও প্রশংসার আকাক্সক্ষী তিনি ছিলেন না। তিনি সারাজীবন যে মহৎ কাজ করেছেন তা মহান আল্লাহর সন্তুষ্টির জন্য করেছেন। তিনি ১৯৯৪ সালে বাংলাদেশ ইসলামিক স্কুল, দুবাই সাহিত্য পুরস্কার লাভ করেন। ২০০০ সালে কিশোর কণ্ঠ সাহিত্য পুরস্কার এবং ২০১০ সালে বাংলা সাহিত্য পরিষদ পুরস্কার লাভ করেন। তিনি যেসব পুরস্কার ও স্বীকৃতি পেয়েছেন তার চেয়ে আরো বড় পুরস্কার পাওয়া উচিত ছিল অর্থাৎ পাওয়ার মত উপযুক্ত তিনি ছিলেন। তিনি ছিলেন উপমহাদেশের মুসলিম জাগরণের অনন্য সিপাহাসালার।&nbsp;</p>";

    String a1 = "<p><strong>আবুল আ'লা মওদুদী</strong>&nbsp;(২৫ সেপ্টেম্বর ১৯০৩&nbsp;&ndash; ২২ সেপ্টেম্বের ১৯৭৯), যিনি&nbsp;<strong>মাওলানা মওদুদী</strong>, বা&nbsp;<strong>শাইখ সাইয়েদ আবুল আ'লা মওদুদী</strong>&nbsp;নামেও পরিচিত, ছিলেন একজন&nbsp;মুসলিম গবেষক,&nbsp;আইনবিদ,&nbsp;ইতিহাসবিদ,&nbsp;সাংবাদিক, রাজনৈতিক নেতা এবং বিংশ শতাব্দীর অন্যতম প্রখ্যাত&nbsp;ইসলামী চিন্তাবিদ&nbsp;ও&nbsp;দার্শনিক। উইলফ্রেড ক্যান্টওয়েল স্মিথ&nbsp;তাকে \"আধুনিক ইসলামের সবচেয়ে নিয়মতান্ত্রিক চিন্তাবিদ\" হিসাবে বর্ণনা করেছেন। সাইয়েদ আবুল আ&rsquo;লা মওদুদী কুরআনের ব্যাখ্যা,&nbsp;হাদিস, আইন, দর্শন এবং ইতিহাসের মতো বিভিন্ন শাখায় প্রচুর কাজ করেছেন। তার লেখাগুলো মূলত উর্দুতে । পরে তার লেখাগুলো ইংরেজী,&nbsp;আরবি,&nbsp;হিন্দি,&nbsp;বাংলা,&nbsp;তামিল,&nbsp;তেলুগু,&nbsp;কন্নড়, বর্মি,&nbsp;মালায়ালাম&nbsp;এবং অন্যান্য অনেক ভাষায় অনুবাদ করা হয়। তিনি মুসলিম মিল্লাতের কাছে&nbsp;ইসলামের&nbsp;আসল রুপ তুলে ধরার চেষ্টা করেন। দ্বীনী জ্ঞান নেয়ার ক্ষেত্রে তিনি অত্যন্ত সচেতন ছিলেন, এ ব্যাপারে মাওলানা মওদুদী বলেন, \"আমি&nbsp;অতীত&nbsp;ও বর্তমানের কারো কাছ থেকে&nbsp;দ্বীনকে&nbsp;বুঝবার চেষ্টা না করে সর্বদা&nbsp;কোরআন&nbsp;ও&nbsp;সুন্নাহ&nbsp;থেকে বুঝবার চেষ্টা করেছি। অতএব খোদার&nbsp;দ্বীন&nbsp;আমার ও প্রত্যেক মুমিনের কাছ থেকে কি দাবি করে, এ কথা জানার জন্যে আমি দেখার চেষ্টা করি না যে, অমুক বুযুর্গ কি বলেন ও কি করেন। বরঞ্চ শুধু দেখার চেষ্টা করি যে,&nbsp;কোরআন&nbsp;কি বলে এবং তার&nbsp;রাসূল&nbsp;(সাঃ) কি করেছেন।\" তিনি বিশ্বাস করতেন যে, মুসলিমদের রাজনীতির&nbsp;ইসলাম&nbsp;জন্য অপরিহার্য।&nbsp;শরিয়া&nbsp;এবং ইসলামী সংস্কৃতি সংরক্ষণ করা প্রয়োজন&nbsp;খিলাফতে&nbsp;রাশিদুনের&nbsp;শাসনের মতো এবং অনৈতিকতা ত্যাগ করা প্রয়োজন। তিনি পশ্চিমা সাম্রাজ্যবাদের কুফল হিসেবে&nbsp;ধর্মনিরপেক্ষতা,&nbsp;জাতীয়তাবাদ&nbsp;এবং&nbsp;সমাজতন্ত্রকে&nbsp;দেখতেন। </p>\n" +
            "<p>তিনি নিজ দেশ পাকিস্তানের একজন রাজনৈতিক ব্যক্তিত্বও ছিলেন। তিনি এশিয়ার তৎকালীন বৃহত্তম ইসলামী সংগঠন&nbsp;জামায়াতে ইসলামী&nbsp;নামক একটি ইসলামী রাজনৈতিক দলের প্রতিষ্ঠাতা।  তিনি ছিলেন&nbsp;২০ শতাব্দীর আলোচিত মুসলিম আলেমদের&nbsp;মধ্যে একজন। ইসলাম ধর্মে অবদানের স্বীকৃত স্বরূপ তাকে ১৯৭৯ সালে&nbsp;কিং ফয়সাল ফাউন্ডেশন&nbsp;কর্তৃক&nbsp;বাদশাহ ফয়সাল পুরস্কারটি&nbsp;প্রদান করা হয়। </p>\n" +
            "<h2><span id=\".E0.A6.AA.E0.A7.8D.E0.A6.B0.E0.A6.BE.E0.A6.B0.E0.A6.AE.E0.A7.8D.E0.A6.AD.E0.A6.BF.E0.A6.95_.E0.A6.9C.E0.A7.80.E0.A6.AC.E0.A6.A8\"></span><span id=\"প্রারম্ভিক_জীবন\" class=\"mw-headline\">প্রারম্ভিক জীবন</span></h2>\n" +
            "<h3><span id=\".E0.A6.AA.E0.A6.9F.E0.A6.AD.E0.A7.82.E0.A6.AE.E0.A6.BF\"></span><span id=\"পটভূমি\" class=\"mw-headline\">পটভূমি</span></h3>\n" +
            "<p><strong>মাওলানা মওদুদী</strong>&nbsp;ভারতের&nbsp;হায়দারাবাদের&nbsp;(বর্তমান&nbsp;মহারাষ্ট্র)&nbsp;আওরঙ্গবাদ&nbsp;শহরে জন্মগ্রহণ করেন। পিতার নাম সাইয়েদ আহমদ হাসান, তিনি পেশায় ছিলেন আইনজীবী। মাওলানা মওদুদী বংশীয় দিক দিয়ে সাইয়িদুনা হুসাইন শহিদের ৩৬তম উত্তর পুরুষ। তাঁর ২৩তম পূর্বপুরুষ খাজা কুতুব উদ্দীন মওদুদ চিশতি (মৃ.৫২৭ হিজরী) ভারতে&nbsp;চিশতিয়া তরিকার&nbsp;আদি পীর হিসেবে পরিচিত। তাঁর নামানুসারেই এ বংশের লোকজন&nbsp;<strong>&lsquo;মওদুদী&rsquo;</strong>&nbsp;নামে পরিচিত। মওদুদী খান্দানের কয়েক প্রজন্ম বংশ পরম্বরায় দাওয়াত-তাবলীগ ও পীর-মুরশিদির সাথে সম্পৃক্ত ছিলেন।</p>\n" +
            "<p>সাইয়েদ আবুল আ&rsquo;লা মওদুদীর মাতার নাম রুকাইয়া বেগম। মায়ের দিক দিয়ে মাওলানা মওদুদী তুর্কি বংশোদ্ভূত। মাওলানা আহমদ হাসানের তিন সন্তানের মধ্যে তিনি সব থেকে ছোট ছিলেন। তাঁর প্রমাতামহ মির্যা কোরবান আলী বেগ খান সালেক একজন&nbsp;তুর্কী&nbsp;কবি ও সাহিত্যিক ছিলেন (১৮১৬-১৮৮১) ছিলেন দিল্লিতে একজন সুপরিচিত লেখক ও কবি, বিখ্যাত উর্দু কবি&nbsp;গালিবের&nbsp;বন্ধু। কিন্তু সৈনিক বৃত্তিই তাঁর পূর্ব-পুরুষগণের আসল পেশা ছিল। মির্যা তোলক বে নামক তার জনৈক পূর্ব পুরুষ বাদশাহ&nbsp;আওরঙ্গজেব&nbsp;আলমগীরের আমলে ভারতে আগমন করে সেনা বিভাগে যোগদান করেন। বাদশাহ শাহ আলমের রাজত্বকাল পর্যন্ত উক্ত পরিবারের লোক কোন না কোন শাহী মসনদ অধিকার করেছিলেন। মোঘল সাম্রাজ্য পতনের পর তারাও বিভিন্ন দিকে বিচ্ছিন্ন হয়ে পড়ে। </p>\n" +
            "<h3><span id=\".E0.A6.B6.E0.A7.88.E0.A6.B6.E0.A6.AC\"></span><span id=\"শৈশব\" class=\"mw-headline\">শৈশব</span></h3>\n" +
            "<p>আবুল আ&rsquo;লার শিক্ষাজীবনের সূচনা হয় বাড়িতে গৃহশিক্ষকের তত্ত্বাবধানে। তিনি তার পিতার হাতে এবং তার দ্বারা নিযুক্ত বিভিন্ন শিক্ষকের কাছ থেকে ধর্মীয় শিক্ষা লাভ করেন। তার পিতা তাকে মৌলবী বানাতে চেয়েছিলেন। নয় বছর বয়স পর্যন্ত তিনি তৎকালীন প্রসিদ্ধ আলেম আব্দুস সালাম নিয়াযীর কাছে প্রাথমিক শিক্ষা লাভ করেন। এই শিক্ষার মধ্যে ছিল&nbsp;আরবি,&nbsp;ফারসি, সাহিত্য, কোরআন, ফেকাহ,ইসলামী আইন ও হাদীস শিক্ষা। িনি মানতিক (যুক্তিবিদ্যা) বইগুলিও অধ্যয়ন করেন। ১১ বছর বয়সে মওলানা&nbsp; কাশিম আমিনের লেখা বই আল-মারহা আল-জাদিদাহ আরবি থেকে উর্দুতে অনুবাদ করেন। কয়েক বছর পর, তিনি পারস্যের রহস্যময় চিন্তাবিদ মোল্লা সাদ্রাের বই&nbsp;<em><strong>আসফারের</strong></em>&nbsp;প্রায় ৩,৫০০ পৃষ্ঠার অনুবাদ করেন। সাম্রাজ্যের পুনর্জীবনের ধারণা এবং মানুষের আধ্যাত্মিক পুনরুজ্জীবনের জন্য ইসলামী আইন (শরিয়া) শাসনের প্রয়োজনীয়তা নিয়ে সাদ্রার লেখা মওদুদীর চিন্তাধারা প্রভাবিত করে, যার প্রতিচ্ছবি তার লেখা ও কাজে পাওয়া যায়। ></p>\n" +
            "<h3><span id=\".E0.A6.B6.E0.A6.BF.E0.A6.95.E0.A7.8D.E0.A6.B7.E0.A6.BE\"></span><span id=\"শিক্ষা\" class=\"mw-headline\">শিক্ষা</span></h3>\n" +
            "<p>শৈশবের গৃহশিক্ষক মাওলানা নিয়াযীর কাছ থেকে তিনি আরবি ব্যাকরণ, মাআনি ও বালাগাত শিক্ষা লাভ করেন। ১৯১৬ সালে এগারো বছর বয়সে তাকে&nbsp;আল্লামা শিবলী নোমানীর প্রতিষ্ঠিত&nbsp;মাদ্রাসা 'ফওকানিয়া মাদরাসায়' রুশদিয়া শ্রেণীতে (৮ম শ্রেণী) ভর্তি করা হয়। সেখান থেকে তিনি 'ম্যাট্রিকুলেশন&rsquo; মানের &lsquo;মৌলভি&rsquo; পাশ করেন। এরপর তিনি হায়দ্রাবাদের ঐতিহ্যবাহী দারুল উলূমে চলে যান। তিনি আলিম তথা উচ্চ মাধ্যমিকে ভর্তি হন। কিন্তু অধ্যয়নের ছয় মাসের মাথায় পিতার অসুস্থতার কারণে তাকে খেদমতের জন্য লেখাপড়া অসমাপ্ত রেখে ভূপালে চলে যেতে হয়। পিতার অসুস্থতায় উপার্জনের তাগিদে প্রাতিষ্ঠানিক শিক্ষায় তার ইতি ঘটে। </p>\n" +
            "<p>১৯২০ সালে তার পিতা আহমদ হাসান মৃত্যুর পর তিনি ভুপাল হতে দিল্লি চলে যান। জীবিকার প্রয়োজনে তিনি সাংবাদিকতা পেশায় যুক্ত হন। সাংবাদিকতার পাশাপাশি পুনরায় জ্ঞানার্জনে মনোযোগ দেন আবুল আ&rsquo;লা। এসময় তিনি সমাজবিজ্ঞান, পশ্চিমা দর্শন এবং ইতিহাস অধ্যয়ন করার জন্য ইংরেজী ও জার্মান ভাষা শিখেন। কোনো প্রতিষ্ঠানে ভর্তি না হলেও খ্যাতনামা আলেমদের কাছ থেকে ইলম হাসিল করেন এবং সনদ লাভ করেন। দিল্লির দারুল উলুম ফতেহপুর এর শিক্ষক মাওলানা শরিফুল্লাহ খানের তত্ত্বাবধানে ১৯২৬ সালের ১২ জানুয়ারি &lsquo;উলুমে আকলিয়া ও আদাবিয়্যা ওয়াবালাগাত&rsquo; এবং &lsquo;উলুমে আকালিয়া ওআদাবিয়্যা ওয়াফরুইয়া&rsquo; সনদ অর্জন করেন। একই প্রতিষ্ঠানের শিক্ষক মাওলানা আশফাকুর রহমান কান্ধলভির কাছ থেকে ১৯২৭ সালে হাদিস, ফিকহ ও আরবি সাহিত্যে সনদ লাভ করেন। ১৯২৮ সালে জামে তিরমিযি এবং মুয়াত্তায়ে মালেক সমাপ্তির সনদপ্রাপ্ত হন। </p>\n" +
            "<h2><span id=\".E0.A6.B8.E0.A6.BE.E0.A6.82.E0.A6.AC.E0.A6.BE.E0.A6.A6.E0.A6.BF.E0.A6.95.E0.A6.A4.E0.A6.BE\"></span><span id=\"সাংবাদিকতা\" class=\"mw-headline\">সাংবাদিকতা</span></h2>\n" +
            "<p>১৯১৮ সালে মাত্র পনেরো বছর বয়সে কর্মজীবনে প্রবেশ করেন। তার বড়ো ভাই আবুল খায়ের মওদুদী বিজনৌর থেকে প্রকাশিত 'মদিনা&rsquo; পত্রিকার সম্পাদক ছিলেন। বড়ো ভাইয়ের সাথে দুই মাস কাজ করেন মওদুদী। এভাবেই তার কর্মজীবনের সূত্রপাত হয় । ১৯২০ সালে ১৭ বছর বয়সে &lsquo;সাপ্তাহিক তাজ&rsquo; পত্রিকার সম্পাদক নিযুক্ত হন । তার সম্পাদনায় পত্রিকাটি পরবর্তী সময়ে দৈনিকে রুপান্তরিত হয়। কিন্তু অল্প কিছুকাল পরেই&nbsp;ব্রিটিশবিরোধী&nbsp;সম্পাদকীয় লেখার কারণে তাজ পত্রিকার অফিসিয়াল সম্পাদক ও মালিক তাজ উদ্দিন সরকার কর্তৃক মামলায় পড়েন। তখন সাইয়েদ মওদুদী আবার জব্বলপুর ছেড়ে দিল্লি চলে আসতে বাধ্য হন। </p>\n" +
            "<p>১৯২২ সালে দিল্লিতে জমিয়তে উলামায়ে হিন্দের সভাপতি মাওলানা আহমদ সাঈদ ও মুফতি কেফায়ত উল্লাহর অনুরোধে&nbsp;জমিয়তে উলামায়ে হিন্দের&nbsp;মুখপত্র &lsquo;মুসলিম&rsquo; পত্রিকার সম্পাদনার দায়িত্ব গ্রহণ করেন আবুল আ&rsquo;লা মওদুদী। ১৯২৩ সালে &lsquo;মুসলিম&rsquo; পত্রিকা বন্ধ হয়ে যায়। ১৯২৪ সালে পুনরায় &lsquo;আল-জমিয়ত&rsquo; নামে জমিয়তে উলামায়ে হিন্দের মুখপত্রের প্রকাশনা শুরু হয়। সাইয়েদ মওদুদীকে আবার &lsquo;আল-জমিয়ত&rsquo;-এর সম্পাদক পদে নিয়োগ দেয়া হয়। ১৯২৮ সাল পর্যন্ত টানা দায়িত্ব পালনের পর জমিয়ত কর্তৃপক্ষের সাথে জাতীয়তার প্রশ্নে মতবিরোধ হলে তিনি পদত্যাগ করেন। চার বছর বিরতির পর ১৯৩২ সালে মাসিক &lsquo;তরজুমানুল কুরআন&rsquo; প্রকাশনার মধ্য দিয়ে পুনরায় সাংবাদিকতায় জড়িত হন। মওদুদী প্রতিষ্ঠিত এ মাসিক পত্রিকাটি এখনও নিয়মিত প্রকাশিত হচ্ছে।&nbsp; </p>\n" +
            "<h2><span id=\".E0.A6.B2.E0.A7.87.E0.A6.96.E0.A6.BE.E0.A6.9C.E0.A7.8B.E0.A6.95.E0.A6.BE\"></span><span id=\"লেখাজোকা\" class=\"mw-headline\">লেখাজোকা</span></h2>\n" +
            "<p>১৯২৬ উগ্র হিন্দুবাদী নেতা স্বামী শ্রদ্ধানন্দ &lsquo;শুদ্ধি আন্দোলন&rsquo; শুরু করে। প্রচারণা চালিয়ে, লোভ-ভয় দেখিয়ে এবং চাপ সৃষ্টি করে কিছু নিঃস্ব অসহায় মুসলিমকে হিন্দু ধর্মে দীক্ষিত করা হয়। এ ঘটনা মুসলিমদের মাঝে চরম উত্তেজনার সৃষ্টি করে। এ পরিস্থিতিতে দিল্লি শাহী জামে মসজিদে মাওলানা মুহাম্মদ আলী জওহর এ সমস্ত ভিত্তিহীন এবং উস্কানীমূলক প্রচারণায় অতীব দুঃখ প্রকাশ করে বলেন,</p>\n" +
            "<blockquote>\n" +
            "<p><strong>\"আহা! আজ যদি ভারতে এমন কোন মর্দে মুজাহিদ আল্লাহর বান্দা থাকতো, যে তাদের এসব হীন প্রচারণার দাঁতভাঙ্গা জবাব দিতে পারতো, তাহলে কতই না ভাল হতো!\"</strong></p>\n" +
            "</blockquote>\n" +
            "<p>মাওলানা মুহাম্মদ আলী জওহরের কথায় প্রচন্ড প্রভাবিত হন মওদুদী। ১৯২৭ সালে উগ্র হিন্দুবাদী অপপ্রচারের জবাব এবং জিহাদের যৌক্তিকতা প্রমাণে মওদুদীর &lsquo;<em><strong>আল-জিহাদ ফিল ইসলাম&rsquo;</strong></em>&nbsp;শীর্ষক প্রবন্ধ সিরিজ জমিয়ত পত্রিকায় ধারাবাহিকভাবে প্রকাশ করেন। পরবর্তী সময়ে তা বিরাট গ্রন্থ আকারে প্রকাশিত হয়।হিন্দুত্ববাদীদের অপপ্রচারের সমুচিত ও যৌক্তিক জবাব সম্বলিত বইটি ব্যাপক জনপ্রিয়তা অর্জন করে।&nbsp;ডক্টর মুহাম্মদ ইকবাল&nbsp;গ্রন্থখানি সম্পর্কে মন্তব্য করেন-</p>\n" +
            "<blockquote>\n" +
            "<p><strong>\"জেহাদ, যুদ্ধ ও সন্ধি সম্পর্কে ইসলামী আইন-কানুন সম্বলিত এ গ্রন্থখানা অভিনব ও চমৎকার হয়েছে। প্রত্যেক জ্ঞানী ও সুধী ব্যক্তিকে গ্রন্থখানি পাঠ করতে অনুরোধ করি।\"</strong> </p>\n" +
            "</blockquote>\n" +
            "<p>১৯৩২ সালে তিনি&nbsp;<strong>তার্জমানুল কুরআন</strong>&nbsp;পত্রিকায় প্রকাশ শুরু করেন। ১৯৩৩ সাল থেকে ১৯৪০ পর্যন্ত সময়ে তার্জমানুল কুরআনে সাইয়েদ মওদুদীর গুরুত্বপূর্ণ ও মৌলিক গবেষণা গুলো প্রকাশিত হয়। এ পত্রিকার মাধ্যমে তার রাজনৈতিক চিন্তাধারার ছড়িয়ে যেতে থাকে। সমসাময়িক বিষয়,&nbsp;খিলাফত, ইসলামের পুনরুজ্জীবন, ব্যক্তিজীবনে ইসলামকে ফিরিয়ে আনা, ইত্যাদি বিষয়ে তিনি ধারাবাহিক ভাবে লিখতে থাকেন। এ সময় তিনি একজন গুরুত্বপূর্ণ এবং প্রভাবশালী ব্যক্তিত্ব হয়ে উঠেন। </p>\n" +
            "<p>ইসলামের বুনিয়াদী শিক্ষা,সুদ ও আধুনিক ব্যাংকিং, ইসলামী রেনেসাঁ আন্দোলন, ইসলাম ও জাতীয়তাবাদ, ইসলাম ও পাশ্চাত্য সভ্যতার দ্বন্দ্ব, ইসলামী সংস্কৃতির মর্মকথা,পর্দা, ভারতের স্বাধীনতা আন্দোলন ও মুসলমান প্রভৃতি মূল্যবান গ্রন্থ এই সময়ে রচিত হয়। মওলানার জীবনের সব থেকে গুরুত্বপূর্ণ ও তাৎপর্যপূর্ণ কাজ হচ্ছে তাফসীরে&nbsp;তাফহীমুল কুরআন&nbsp;(উর্দু: تفہيم القرآن&lrm;, ইংরেজী: Towards Understanding the Qur'an বাংলা:&nbsp;তাফহীমুল কুরআন) উর্দু এই তাফসীরটি লিখতে তার জীবনের বড় অংশ ব্যয় করেন। </p>\n" +
            "<h2><span id=\".E0.A6.AC.E0.A6.BF.E0.A6.AC.E0.A6.BE.E0.A6.B9\"></span><span id=\"বিবাহ\" class=\"mw-headline\">বিবাহ</span></h2>\n" +
            "<p>১৯৩৭ সালের ১৫ই মার্চ দিল্লির এক শরিফ পরিবারের সাইয়িদ নাসির উদ্দিন শামসির কন্যা মাহমুদা বেগমের সাথে মওদুদীর বিবাহ সম্পাদিত হয়। তখনকার দিল্লির ধনী পরিবারগুলোর বিয়েতে লক্ষাধিক টাকার মোহরানা ধরা হতো, কিন্তু তা পরিশোধ করা হতো না। মওদূদী এ অনৈসলামিক রীতি প্রত্যাখ্যান করেন। মাত্র দুই হাজার টাকা মোহরানায় নিতান্ত অনাড়ম্বরভাবে তাঁর বিয়ে অনুষ্ঠিত হয়। /p>\n" +
            "<h2><span id=\".E0.A6.9C.E0.A7.80.E0.A6.AC.E0.A6.A8.E0.A6.95.E0.A6.BE.E0.A6.B2\"></span><span id=\"জীবনকাল\" class=\"mw-headline\">জীবনকাল</span></h2>\n" +
            "<ul>\n" +
            "<li>১৯০৩- জন্ম গ্রহণ করেন। জন্মস্থানঃ আওরঙ্গাবাদ (বর্তমানে মহারাষ্ট্রের মধ্যে), হায়দারাবাদ, ভারত।</li>\n" +
            "<li>১৯১৮- সাংবাদিক হিসেবে 'বিজনোর' (Bijnore) পত্রিকায় কাজ শুরু করেন।</li>\n" +
            "<li>১৯২০- জবলপুরে 'তাজ' পত্রিকার এডিটর হিসেবে নিয়োগ লাভ করেন।</li>\n" +
            "<li>১৯২১- দিল্লিতে মাওলানা আব্দুস সালাম নিয়াজির কাছে আরবি শিক্ষা গ্রহণ করেন।</li>\n" +
            "<li>১৯২১- দৈনিক 'মুসলিম' পত্রিকার এডিটর হিসেবে নিয়োগ লাভ করেন।</li>\n" +
            "<li>১৯২৫- নয়া দিল্লির 'আল জামিয়াহ' পত্রিকার এডিটর হিসেবে নিয়োগ লাভ।</li>\n" +
            "<li>১৯২৬- দিল্লির 'দারুল উলুম ফতেহপুরি' থেকে 'উলুম-এ-আকালিয়া ওয়া নাকালিয়া' সনদ লাভ করেন।</li>\n" +
            "<li>১৯২৭- 'আল জিহাদ ফিল ইসলাম' নামে জিহাদ বিষয়ক একটি গবেষণাধর্মী গ্রন্থ রচনা শুরু করেন।</li>\n" +
            "<li>১৯২৮- উক্ত প্রতিষ্ঠান (দারুল উলুম ফতেহপুরি) থেকে 'জামে তিরমিযি' এবং 'মুয়াত্তা ইমাম মালিক' সনদ লাভ করেন।</li>\n" +
            "<li>১৯৩০- 'আল জিহাদ ফিল ইসলাম' নামের বিখ্যাত বইটি প্রকাশিত হয়। তখন তার বয়স ২৭ বছর।</li>\n" +
            "<li>১৯৩৩- ভারতের হায়দারাবাদ থেকে 'তরজুমানুল কুরআন' নামক পত্রিকা প্রকাশ শুরু করেন।</li>\n" +
            "<li>১৯৩৭- তার ৩৪ বছর বয়সে, লাহোরে, দক্ষিণ এশিয়ার কিংবদন্তিতুল্য মুসলিম কবি ও দার্শনিক&nbsp;আল্লামা মুহাম্মাদ ইকবালের&nbsp;সাথে পরিচয় হয়। পরিচয় করিয়ে দেন চৌধুরী নিয়াজ আলী খান।</li>\n" +
            "<li>১৯৩৮- তার ৩৫ বছর বয়সে, হায়দারাবাদ থেকে পাঠানকোটে গমন করেন। সেখানে তিনি দারুল ইসলাম ট্রাস্ট ইনস্টিটিউটে যোগদান করেন, যেটি ১৯৩৬ সালে আল্লামা ইকবালের পরামর্শে চৌধুরী নিয়াজ আলী খান কর্তৃক প্রতিষ্ঠিত হয়েছিল। পাঠানকোটের ৫ কিমি পশ্চিমে, জামালপুরে, চৌধুরী নিয়াজ আলী খানের ১০০০ একর এস্টেট ছিল। চৌধুরী নিয়াজ আলী খান সেখান থেকে ৬৬ একর জমি মাওলানা মওদুদীকে দান করেন।</li>\n" +
            "<li>১৯৪১- লাহোরে 'জামায়াতে ইসলামী হিন্দ' নামে একটি ইসলামী রাজনৈতিক দল প্রতিষ্ঠা করেন এবং এর আমির হন।</li>\n" +
            "<li>১৯৪২ - জামায়াতে ইসলামীর প্রধান কার্যালয় পাঠানকোটে স্থানান্তর করেন।</li>\n" +
            "<li>১৯৪২ - তাফহীমুল কুরআন নামক তাফসির গ্রন্থ প্রনয়ন শুরু করেন।</li>\n" +
            "<li>১৯৪৭ - জামায়াতে ইসলামীর প্রধান কার্যালয় লাহোরের ইছরায় স্থানান্তর করেন।</li>\n" +
            "</ul>\n" +
            "<div class=\"thumb tright\">\n" +
            "<div class=\"thumbinner\"><img class=\"thumbimage\" src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/House_maududi2.jpg/220px-House_maududi2.jpg\" srcset=\"//upload.wikimedia.org/wikipedia/commons/4/49/House_maududi2.jpg 1.5x\" alt=\"\" width=\"220\" height=\"293\" data-file-width=\"240\" data-file-height=\"320\" />\n" +
            "<div class=\"thumbcaption\">\n" +
            "<div class=\"magnify\">&nbsp;</div>\n" +
            "সাইয়েদ আবুল আ'লা মওদুদীর বাড়ির প্রবেশ পথ, ইছরা, লাহোর</div>\n" +
            "</div>\n" +
            "</div>\n" +
            "<ul>\n" +
            "<li>১৯৪৮ - 'ইসলামী সংবিধান' ও 'ইসলামী সরকার' প্রতিষ্ঠার জন্য প্রচারণা শুরু করেন।</li>\n" +
            "<li>১৯৪৮ - পাকিস্তান সরকার তাকে কারাগারে বন্দী করে।</li>\n" +
            "<li>১৯৪৯ - পাকিস্তান সরকার জামায়াতের 'ইসলামী সংবিধানের রূপরেখা' গ্রহণ করে।</li>\n" +
            "<li>১৯৫০ - কারাগার থেকে মুক্তি লাভ করেন।</li>\n" +
            "<li>১৯৫৩- 'কাদিয়ানী সমস্যা' নামে একটি বই লিখে কাদিয়ানী বা আহমদিয়া সম্প্রদায়কে অমুসলিম প্রমাণ করেন। ফলে ইতিহাসখ্যাত বড় রকমের কাদিয়ানী বিরোধী হাঙ্গামার সৃষ্টি হয়। এ সময় অনেকগুলো সংগঠন একযোগে কাদিয়ানীদেরকে সরকারিভাবে অমুসলিম ঘোষণার দাবিতে আন্দোলন শুরু করে। তারা সর্বদলীয় কনভেনশনে ২৭ ফেব্রুয়ারি তারিখে 'ডাইরেক্ট একশন কমিটি' গঠন করে। জামায়াত এই কমিটির বিরোধিতা করে অহিংস আন্দোলনের পক্ষে অবস্থান নেয়। কিন্তু তথাপি মার্চ মাসের শুরুতে আন্দোলন চরম আকার ধারণ করে এবং পুলিশের গুলিতে কিছু লোক নিহত হয়। পরে একটি সামরিক আদালত আবুল আ'লাকে এই গোলযোগের জন্য দোষী সাব্যস্ত করে মৃত্যুদন্ডের আদেশ দেয়, (যদিও কাদিয়ানী সমস্যা নামক বইটি বাজেয়াপ্ত করা হয়নি)। অবশ্য সেই মৃত্যুদন্ডাদেশ কার্যকর করা হয়নি। </li>\n" +
            "<li>১৯৫৩- মুসলিমপ্রধান দেশগুলোর চাপ এবং দেশী বিদেশী মুসলিম নেতৃবৃন্দের অনুরোধে মৃত্যুদন্ডাদেশ পরিবর্তন করে যাবজ্জীবন কারাদন্ড করা হয়, কিন্তু পরে তা-ও প্রত্যাহার করা হয়।</li>\n" +
            "<li>১৯৫৮- সামরিক শাসক ফিল্ড মার্শাল&nbsp;আইয়ুব খান&nbsp;'জামায়াতে ইসলামী'কে নিষিদ্ধ ঘোষণা করেন।</li>\n" +
            "<li>১৯৬৪- আবারো তাকে কারাবন্দী করা হয়।</li>\n" +
            "<li>১৯৬৪- কারাগার থেকে মুক্তি দেয়া হয়।</li>\n" +
            "<li>১৯৭১- পাকিস্তান থেকে তৎকালীন পূর্ব পাকিস্তান আলাদা হবে কিনা এ প্রশ্নে সিদ্ধান্ত নেওয়ার অধিকার পূর্ব পাকিস্তান জামায়াতের উপর ন্যাস্ত করেন.= </li>\n" +
            "<li>১৯৭২- তাফহীমুল কুরআন নামক তাফসির গ্রন্থটির রচনা সম্পন্ন করেন।</li>\n" +
            "<li>১৯৭২- জামায়াতে ইসলামীর আমির পদ থেকে ইস্তফা দেন।</li>\n" +
            "<li>১৯৭৮- তার রচিত শেষ বই 'সিরাতে সারওয়ারে আলম' প্রকাশিত হয়। এটি নবী মুহাম্মাদ-এর জীবনী গ্রন্থ।</li>\n" +
            "<li>১৯৭৯- \"ইসলাম পরিসেবায়\" এই বিভাগে মুসলিম বিশ্বের নোবেলখ্যাত বাদশাহ ফয়সাল আন্তর্জাতিক পুরস্কার লাভ করেন। </li>\n" +
            "<li>১৯৭৯- চিকিৎসার জন্য যুক্তরাষ্ট্রে গমন করেন।</li>\n" +
            "<li>১৯৭৯- যুক্তরাষ্ট্রে তার মৃত্যু হয়। </li>\n" +
            "<li>১৯৭৯- লাহোরের ইছরায় সমাধিস্থ করা হয়।</li>\n" +
            "</ul>\n" +
            "<div class=\"thumb tright\">\n" +
            "<div class=\"thumbinner\"><img class=\"thumbimage\" src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Grave_maududi.jpg/220px-Grave_maududi.jpg\" srcset=\"//upload.wikimedia.org/wikipedia/commons/0/08/Grave_maududi.jpg 1.5x\" alt=\"\" width=\"220\" height=\"293\" data-file-width=\"240\" data-file-height=\"320\" />\n" +
            "<div class=\"thumbcaption\">\n" +
            "<div class=\"magnify\">&nbsp;</div>\n" +
            "সাইয়েদ আবুল আ'লা মওদুদীর কবর</div>\n" +
            "</div>\n" +
            "</div>\n" +
            "<h2><span id=\".E0.A6.97.E0.A7.8D.E0.A6.B0.E0.A6.A8.E0.A7.8D.E0.A6.A5.E0.A6.BE.E0.A6.AC.E0.A6.B2.E0.A7.80\"></span><span id=\"গ্রন্থাবলী\" class=\"mw-headline\">গ্রন্থাবলী</span></h2>\n" +
            "<dl>\n" +
            "<dt>কুরআন</dt>\n" +
            "</dl>\n" +
            "<ul>\n" +
            "<li>তরজমায়ে কুরআন মজীদ &ndash; তরজুমায়ে কুরআন মজীদ;</li>\n" +
            "<li>তাফহীমুল কুরআন &ndash;&nbsp;তাফহীমুল কুরআন;</li>\n" +
            "<li>তাফহীমুল কুরআন বিষয় নির্দেশিকা &ndash; মাওয়ূয়াতে কুরআনী;</li>\n" +
            "<li>কুরআনের মর্মকথা &ndash; মুকাদ্দামায়ে তাফহীমুল কুরআন;</li>\n" +
            "<li>কুরআনের চারটি মৌলিক পরিভাষা &ndash; কুরআন কী চার বুনয়াদী ইসতেলার্হী।</li>\n" +
            "</ul>\n" +
            "<dl>\n" +
            "<dt>হাদীস/সুন্নাহ</dt>\n" +
            "</dl>\n" +
            "<ul>\n" +
            "<li>সুন্নাতে রাসূলের আইনগত মর্যাদা &ndash; সুন্নাত কী আইনি হাইসিয়ত;</li>\n" +
            "<li>কুরআনের মহত্ব ও মর্যাদা &ndash; ফাযায়েলে কুরআন (হাদীস কী রোশনী মেঁ)।</li>\n" +
            "</ul>\n" +
            "<dl>\n" +
            "<dt>ইসলামী জীবন দর্শন</dt>\n" +
            "</dl>\n" +
            "<ul>\n" +
            "<li>ইসলাম পরিচিতি &ndash; রিসালায়ে দ্বীনীয়াত;</li>\n" +
            "<li>ঈমানের হাকিকত &ndash; হাকীকতে ঈমান;</li>\n" +
            "<li>ইসলামের হাকিকত &ndash; হাকীকতে ইসলাম;</li>\n" +
            "<li>নামায রোযার হাকিকত &ndash; হাকীকতে সাওম আওর সালাত;</li>\n" +
            "<li>জিহাদের হাকিকত &ndash; হাকীকতে জিহাদ;</li>\n" +
            "<li>হজ্জের হাকিকত &ndash; হাকীকতে হজ্জ;</li>\n" +
            "<li>যাকাতের হাকিকত &ndash; হাকীকতে যাকাত;</li>\n" +
            "<li>তাকদীরের হাকিকত &ndash; মাসয়ালায়ে জবর ওয়া কদর;</li>\n" +
            "<li>তাকওয়ার হাকিকত &ndash; হাকীকতে তাকওয়া;</li>\n" +
            "<li>শিরকের হাকিকত &ndash; হাকীকতে শিরক;</li>\n" +
            "<li>তাওহীদের হাকিকত &ndash; হাকীকতে তাওহীদ;</li>\n" +
            "<li>শান্তিপথ &ndash; সালামতী কা রাস্তা;</li>\n" +
            "<li>একমাত্র ধর্ম &ndash; দ্বীনে হক;</li>\n" +
            "<li>তাওহীদ রিসালাত ও আখিরাত &ndash; তাওহীদ রিসালাত আওর যীন্দেগী বা&rsquo;দ মওতকা আকলী সুবুত;</li>\n" +
            "<li>ইসলামের জীবন পদ্ধতি &ndash; ইসলাম কা নেযামে হায়াত;</li>\n" +
            "<li>ইসলাম ও জাহেলিয়াত &ndash; ইসলাম আওর জাহেলিয়াত;</li>\n" +
            "<li>ইসলামের শক্তির উৎস &ndash; ইসলাম কা ছের চশমায়ে কুঅত;</li>\n" +
            "<li>কুরবানীর তাৎপর্য &ndash; ইসবাতে কুরবানী বিআয়াতে কুরআনী;</li>\n" +
            "<li>ইসলামের নৈতিক দৃষ্টিকোণ &ndash; ইসলাম কা আখলাকী নোকতায়ে নযর;</li>\n" +
            "<li>ইসলামী দাওয়াতের দার্শনিক ভিত্তি &ndash; ইসলাম আওর মাগরিবী লা দ্বীনী জমহুরিয়ত;</li>\n" +
            "<li>ইসলাম ও সামাজিক সুবিচার &ndash; ইসলাম আওর আদলে ইজতেমায়ী;</li>\n" +
            "<li>ইসলামী জীবন ব্যবস্থার মৌলিক রূপরেখা &ndash; ইসলামী নেযামে যিন্দেগী আওর উসকে বুনয়াদী তাসবিরাত;</li>\n" +
            "<li>ইসলাম ও পাশ্চাত্য সভ্যতার দ্বন্দ্ব &ndash; তানকীহাত;</li>\n" +
            "<li>ইসলামী সংস্কৃতির মর্মকথা &ndash; ইসলামী তাহযীব আওর উসকে উসুল ওয়া মুবাদী;</li>\n" +
            "<li>ইসলাম ও জাতীয়তাবাদ &ndash; মাসয়ালায়ে কাওমিয়াত;</li>\n" +
            "<li>ইসলাম ও সমাজতন্ত্র;</li>\n" +
            "<li>শিক্ষা ব্যবস্থা&nbsp;: ইসলামী দৃষ্টিকোণ &ndash; তা&rsquo;লীমাত;</li>\n" +
            "<li>আল জিহাদ&nbsp;&ndash; আল জিহাদু ফিল ইসলাম;</li>\n" +
            "<li>নির্বাচিত রচনাবলী (১-৩ভাগ) &ndash; তাফহীমাত (১-৩জিলদ)।</li>\n" +
            "</ul>\n" +
            "<dl>\n" +
            "<dt>আইন, রাজনীতি ও রাষ্ট্রীয় ব্যবস্থা</dt>\n" +
            "</dl>\n" +
            "<ul>\n" +
            "<li>ইসলামের রাজনৈতিক মতবাদ -ইসলাম কা নযরিয়ায়ে সিয়াসী;</li>\n" +
            "<li>ইসলামী রাষ্ট্র &ndash; ইসলামী রিয়াসত;</li>\n" +
            "<li>ইসলামী শাসনতন্ত্র প্রণয়ন &ndash; ইসলামী দস্তুর কি তাদবীন;</li>\n" +
            "<li>ইসলামী শাসন্তন্ত্রের মূলনীতি &ndash; ইসলামী দস্তুর কি বুনিয়াদী;</li>\n" +
            "<li>ইসলামী আইন &ndash; ইসলামী কানুন;</li>\n" +
            "<li>ইসলামে মৌলিক মানবাধিকার &ndash; ইনসানকে বুনিয়াদী হুকুম;</li>\n" +
            "<li>ইসলামী রাষ্ট্রে অমুসলিমদের অধিকার &ndash; ইসলামী রিয়াসত মে জিম্মীয়ু কী হুকুক;</li>\n" +
            "<li>খেলাফত ও রাজতন্ত্র &ndash; খিলাফত ওয়া মুলূকিয়াত;</li>\n" +
            "<li>উপমহাদেশের স্বাধীনতা আন্দোলন ও মুসলমান (১-২খন্ড) &ndash; তাহরীকে আযাদী হিন্দ আওর মুসলমান (১-২জিলদ);</li>\n" +
            "<li>কুরআনের রাজনৈতিক শিক্ষা &ndash; কুরআন কী সিয়াসী তা&rsquo;লীমাত;</li>\n" +
            "<li>মুরতাদের শাস্তি &ndash; মুরতাদ কী সাযা;</li>\n" +
            "<li>জাতীয় ঐক্য ও গণতন্ত্রের ভিত্তি &ndash; কওমী ওয়াহদাত;</li>\n" +
            "<li>দাক্ষিণাত্যের রাজনৈতিক ইতিহাস &ndash; দাককিন কী সিয়াসী তারীখ।</li>\n" +
            "</ul>\n" +
            "<dl>\n" +
            "<dt>ইসলামী আন্দোলন ও সংগঠন</dt>\n" +
            "</dl>\n" +
            "<ul>\n" +
            "<li>ইসলামী দাওয়াত ও কর্মনীতি &ndash; দাওয়াতে ইসলামী আওর উসকা তারীক কার;</li>\n" +
            "<li>ইসলামী আন্দোলনের নৈতিক ভিত্তি &ndash; তাহরীকে ইসলামী কী আখলাকী বুনিয়াদী;</li>\n" +
            "<li>দায়ী ইলাল্লাহ দাওয়াত ইলাল্লাহ &ndash; দায়ী ইলাল্লাহ দাওয়াত ইলাল্লাহ;</li>\n" +
            "<li>ভাঙা ও গড়া &ndash; বানাও আওর বেগাড়;</li>\n" +
            "<li>একটি সত্যনিষ্ঠ দলের প্রয়োজন &ndash; এক সালেহ জামায়াত কা জরুরত;</li>\n" +
            "<li>সত্যের সাক্ষ্য &ndash; শাহাদাতে হাক;</li>\n" +
            "<li>জামায়াতে ইসলামীর দাওয়াত &ndash; জামায়াতে ইসলামী কা দাওয়াত;</li>\n" +
            "<li>জামায়াতে ইসলামীর উদ্দেশ্য,ইতিহাস,কর্মসূচী &ndash; জামায়াতে ইসলামী কা মাকসাদে তারীখ আওর লায়েহায়ে আ&rsquo;মল;</li>\n" +
            "<li>ইসলামী বিপ্লবের পথ &ndash; ইসলামী হুকুমাত কিসতারাহ কায়েম হূতী হ্যায়;</li>\n" +
            "<li>মুসলমানদের অতীত, বর্তমান ও ভবিষ্যতের কর্মসূচী &ndash; মুসলমানু কা মাযী হাল মুস্তাকবেল কে লিয়ে লায়েহায়ে আমল;</li>\n" +
            "<li>ইসলামী আন্দোলন সাফল্যের শর্তাবলী &ndash; তাহরীকে ইসলামী কামিয়াবী কা শারায়েত;</li>\n" +
            "<li>আন্দোলন সংগঠন কর্মী &ndash; তাহরীক আওর কারে কুন;</li>\n" +
            "<li>ইসলামী আন্দোলনের ভবিষ্যৎ কর্মসূচী &ndash; তাহরীকে ইসলামী কা আয়েনদাহ লায়েহায়ে আমল;</li>\n" +
            "<li>শাহাদাতে হুসাইন রাঃ &ndash; শাহাদাতে ইমাম হসাইন রাঃ;</li>\n" +
            "<li>আল্লাহর পথে জিহাদ &ndash; জিহাদুন ফি সাবীলিল্লাহ;</li>\n" +
            "<li>বিশ্ব মুসলিম ঐক্যজোট আন্দোলন &ndash; ইত্তেহাদে আলমে ইসলামী;</li>\n" +
            "<li>আজকের দুনিয়ায় ইসলাম &ndash; ইসলাম আসরে হাযের মে;</li>\n" +
            "<li>ইসলামী রেনেসা আন্দোলন &ndash; তাজদীদ ওয়া ইহইয়ায়ে দ্বীন;</li>\n" +
            "<li>জামায়াতে ইসলামীর ঊনত্রিশ বছর &ndash; জামায়াতে ইসলামী কা ঊনত্রিশ সাল।</li>\n" +
            "</ul>\n" +
            "<dl>\n" +
            "<dt>অর্থনীতি ও ব্যাংক ব্যবস্থা</dt>\n" +
            "</dl>\n" +
            "<ul>\n" +
            "<li>ইসলামী অর্থব্যবস্থার মূলনীতি &ndash; ইসলামী মায়া&rsquo;শিয়াত কে উসুল;</li>\n" +
            "<li>কুরআনের অর্থনৈতিক নির্দেশিকা &ndash; কুরআন কী মায়াশী তা&rsquo;লীমাত;</li>\n" +
            "<li>ইসলাম ও আধুনিক অর্থনৈতিক মতবাদ &ndash; ইসলাম আওর জাদীদে মায়া&rsquo;শী নযরিয়াত;</li>\n" +
            "<li>অর্থনৈতিক সমস্যার ইসলামী সমাধান &ndash; ইনসান কা মায়া&rsquo;শী মাসয়ালা আওর উসকা ইসলামী হল;</li>\n" +
            "<li>ভূমির মালিকানা বিধান &ndash; মাসয়ালায়ে মিলকিয়তে যমীন;</li>\n" +
            "<li>জাতীয় মালিকানা &ndash; কওমী মিলকিয়ত;</li>\n" +
            "<li>ইসলামী অর্থনীতি &ndash; মায়াশিয়াতে ইসলাম;</li>\n" +
            "<li>সুদ ও আধুনিক ব্যাংকিং &ndash; সুদ।</li>\n" +
            "</ul>\n" +
            "<dl>\n" +
            "<dt>দাম্পত্য জীবন ও নারী</dt>\n" +
            "</dl>\n" +
            "<ul>\n" +
            "<li>পর্দা ও ইসলাম &ndash; পর্দা;</li>\n" +
            "<li>মুসলিম নারীর নিকট ইসলামের দাবী &ndash; মুসলিম খাওয়াতীন সে ইসলাম কে মুতালিবাত;</li>\n" +
            "<li>স্বামী স্ত্রীর অধিকার &ndash; হুকুকুয যাওজাইন;</li>\n" +
            "<li>ইসলামের দৃষ্টিতে জন্ম নিয়ন্ত্রণ &ndash; ইসলাম আওর যবতে বেলাদাত।</li>\n" +
            "</ul>\n" +
            "<dl>\n" +
            "<dt>তাযকিয়ায়ে নফস</dt>\n" +
            "</dl>\n" +
            "<ul>\n" +
            "<li>হিদায়াত &ndash; হিদায়াত;</li>\n" +
            "<li>ইসলামী ইবাদতের মর্মকথা &ndash; ইসলামী ইবাদত পর তাহকীকী নযর;</li>\n" +
            "<li>আত্মশুদ্ধির ইসলামী পদ্ধতি &ndash; তাযকিয়ায়ে নফস;</li>\n" +
            "<li>ইসলামের বুনিয়াদি শিক্ষা &ndash; খুতবাত।</li>\n" +
            "</ul>\n" +
            "<dl>\n" +
            "<dt>সীরাত</dt>\n" +
            "</dl>\n" +
            "<ul>\n" +
            "<li>আদর্শ মানব &ndash; সরওয়ারে আলম কা আসলী কারণামা;</li>\n" +
            "<li>খতমে নবুয়্যাত &ndash; খতমে নবুওয়াত;</li>\n" +
            "<li>সীরাতে সরওয়ারে আলম (১-২খন্ড) &ndash; সীরাতে সরওয়ারে আলম (১-২জিলদ);</li>\n" +
            "<li>নবীর কুরআনী পরিচয় &ndash; কুরআন আপনে লায়ে ওয়ালে কো কেসরং মেঁ পেশ করতা হায়;</li>\n" +
            "<li>সাহাবায়ে কিরামের মর্যাদা &ndash; মাকামে সাহাবা।</li>\n" +
            "</ul>\n" +
            "<dl>\n" +
            "<dt>অন্যান্য</dt>\n" +
            "</dl>\n" +
            "<ul>\n" +
            "<li>কাদিয়ানী সমস্যা &ndash; কাদিয়ানী মাসয়ালাহ;</li>\n" +
            "<li>রাসায়েল ও মাসায়েল (১-৫খন্ড) &ndash; রাসায়েল ওয়া মাসায়েল (১-৫জিলদ);</li>\n" +
            "<li>যুব সমাজের মুখোমুখি মাওলানা মওদুদী &ndash; তাসরীহাত;</li>\n" +
            "<li>যুব জিজ্ঞাসার জবাব (১-২খন্ড) &ndash; ইসতিফসারাত (১-২জিলদ);</li>\n" +
            "<li>বিকালের আসর (১-২খন্ড) &ndash; আসরী মাজালিশ (১-২জিলদ);</li>\n" +
            "<li>খুতবাতুল হারাম &ndash; খুতবাতুল হারাম;</li>\n" +
            "<li>বেতার বক্তৃতা &ndash; নশরী তাকরীরী;</li>\n" +
            "<li>সাইয়েদ আবুল আ&rsquo;লা মওদুদীর পত্রাবলী (১-২খন্ড) &ndash; মাকাতীব মাওলানা মওদুদী (র.) (১-২জিলদ);</li>\n" +
            "<li>পত্রালাপ মাওলানা মওদুদী ও মরিয়ম জমিলা &ndash; মাওলানা মওদুদী আওর মরিয়ম জমিলা কে দরমিয়ান খত।</li>\n" +
            "</ul>";


}